{
  "job": {
    "title": "Junior Software Engineer",
    "industry": "",
    "description": "<p>Brilliant Solutions is currently seeking a motivated and customer oriented Software Engineer to join our team in Springfield Virginia.</p><p><br></p><p>The engineer will work on a team that provides research, technical guidance, testing, documenting and delivering unique solutions to meet the client's mission. You will have the opportunity to use your critical thinking skills to come up with intuitive designs and visualizations.</p><p><br></p><p><em>Experience:Minimum 2+ years ofknowledge and hands on.</em></p><p><em>Positions Available:1</em></p><p><em>Desired Certification:DoD 8570.1 IAT Level II</em></p><p></p><p>Responsibilities:</p><ul><li>Must haveSoftware Development hands on experience.</li><li>Assist senior developer in the integration of existing software into new or modified systems or operating environments.</li><li>Includes assistance onapplication development, code review andanalysissecurity assessments of various COTSandGOTSapplications.</li><li>Implement automation tasks for server workloads such as writing back-end processes, ANSIBLE playbooks, BASH or PYTHON scripts.</li><li>Opportunity to tackle complex infrastructure, security and development problem sets.</li><li>Developing and automating repeatable tasks.</li><li>Maintain system security and execute common practices/procedures; monitor usage statistics and logs; monitors and remediesattemptto penetrate or corrupt server files.</li><li>Maintain baseline configurations and performs modification of configuration settings and automation solutions.</li></ul><p><br></p><p>Qualifications:</p><ul><li>Assist senior engineers in the design, implementation, and administration of platform tools</li><li>Familiarity with software products with tools such as Ansible, Terraform etc.</li><li>Experience with container configurations and services, especially Docker.</li><li>Experience in collaborative software development using version control systems</li><li>At least two years of professional experience in languages suchPython, Rust and/orGo. Knowledge of web languages such as JavaScript are a plus but not required.</li><li>Ability towrite well-written code following best practices and design patterns.</li><li>Familiar with Continuous Integration / Continuous Deployment (CI/CD) methodologies and products such as GitLab Pipelines, Jenkins, Travis CI, Circle,GithubActions, etc.</li><li>Experiencedwith GITrepositorieswith hands on withtagging, releasing, andbuild processes(other repositories withsimilar codesetup).</li><li>Technical understanding of cybersecurity attack techniques and associated mitigations.</li><li>Experience in UNIX/LINUX Server administration a plus.</li><li>Experience withCloudStorage and Virtualization solutions a plus.</li><li>Experience in setup and maintenance of cloud infrastructure a plus.</li><li>Android/mobile development knowledge is a plus.</li></ul><p><br></p><p>Core Competencies:</p><ul><li>Ability to review work of others and detect errors or needed modifications.</li><li>Ability to work under direction of senior developers/engineers.</li><li>Ability todetermine and develop approach to solutionsquickly.</li><li>Ability to make recommendations to purchase hardware, software, and system\\applicationcomponents.</li><li>Strong communicationskills,shows tact, effective listening skills and follow through.</li><li>Innovation andLearninginnovative technologies.</li></ul><p></p><p><em>Traveland alternate hours:</em></p><ul><li>Occasional travel to customersites insupport of troubleshooting, testing, and deployment activities.</li><li>Ability to work after hours and weekends as needed.(outages/upgrades)</li></ul><p><br></p><p>If you are ready to join our energetic team apply below. The job requires a active TS/SCI clearance.</p>",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-29T22:49:58.000Z"
  },
  "company": {
    "name": "Brilliant Solutions Inc",
    "link": "https://www.linkedin.com/company/brilliant-solutions-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": ""
  },
  "salary": {
    "currency": "",
    "min_value": "",
    "max_value": "",
    "unit": ""
  },
  "location": {
    "country": "US",
    "locality": "Washington DC-Baltimore Area",
    "region": null,
    "postal_code": "21201",
    "street_address": null,
    "latitude": 38.873062,
    "longitude": -77.007385
  }
}