{
  "job": {
    "title": "Software Engineer, Backend",
    "industry": "Construction,Computer Software,Logistics and Supply Chain",
    "description": "<p>Lessen’s software engineering team is the driving engine behind the fastest growing startup in real estate services. Lessen isfundamentally changing how real estate services are initialized, managed, and delivered at scale.The company iswell-funded by top Silicon Valley VCsandhascommitted clients and fast-growing revenue.</p><p><br></p><p>Lessen isbuilding atwo-sidedmarketplace that solves awell-definedset ofcustomer and service professionalneeds.On one side of the marketplace, oursoftwarehandles thelogistics andworkflowtoconnectservice professionalsto high-quality, well-specifiedprojects with same-day payments.On the otherside of the marketplace, our customersget access totimely, integratedproperty servicesincludingrenovations, maintenance, and cleaningfrom the best professionals in the industry.</p><p><br></p><p>We are looking forBackend SeniorSoftwareEngineers who thrive on complex problems and relish the challenge ofbuildingmission-critical systemsthat solve real-world problems.If you are ready to be part of a high-growthstartupthat will stretch your skills and grow your career, we’d love to chat with you.</p><p></p><p><br></p><p>The successful candidate is expected to contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing,and operations. They must possess strong verbal and written communication skills, be self-driven and deliver high-quality results in afast-pacedenvironment. They need to really enjoy working closely with their peers in a group of very smart and talented engineers.</p><p><br></p><p>Our tech stack isbuiltwithmodernsoftware designprinciplesusingTypeScript,GraphQL, Node,Hasura,PostgreSQL,and AWS.As aSenior Engineer, you will helpleadourteams to define ourtechnology choices,architecture,teamprocess,and standards.</p><p></p><p><br></p><p>Our team is intentional about attracting, developing, and retaining amazing talent from diverse backgrounds. We’re looking for teammates that are enthusiastic, empathetic, curious, motivated, reliable, and will help us amplify the positive &amp; inclusive culture we’ve been building.</p><p><br></p><p><strong>BASIC QUALIFICATIONS </strong></p><ul><li>2+ years of overall backend programming experience</li><li>2+ years of experience with Python, NodeJS and GraphQL</li><li>2+ years of experience contributing to the architecture, design, reliability and scaling of new and existingbackendsystems</li><li>A sound understanding of computer science fundamentals such as algorithms, data structures, object-oriented design, functional programming,and databases</li><li>Excellent written and oral communication skills</li><li>High sense of ownership and greatproblem-solving skills</li></ul><p><br></p><p></p><p><strong>PREFERRED QUALIFICATIONS </strong></p><ul><li>Bachelor's in computer science or related field</li><li>3+ years of overall professional software development experience</li><li>Experience in data technologies such asreal-time streaming with Apache Kafka or AWS Kinesis,ETLjobs,datalakes,anddatawarehousing</li><li>Ability to adapt quickly to a fast-paced development environment</li></ul><p></p><p><br></p><p><em>Lessen is intentional about attracting, developing, and retaining amazing talent from diverse backgrounds. We’re looking for teammates that are enthusiastic, empathetic, curious, motivated, reliable, and will help us amplify the positive and inclusive culture we’ve been building. Lessen is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information.</em></p>",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T21:48:44.000Z"
  },
  "company": {
    "name": "Lessen",
    "link": "https://www.linkedin.com/company/lessen-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": ""
  },
  "salary": {
    "currency": "",
    "min_value": "",
    "max_value": "",
    "unit": ""
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}