{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "",
    "description": "<p>Would you like to get involved at the forefront of applying AI &amp; big data technology in life sciences research and work with the leading pharma, biotech and research institutions worldwide? If you are a bioinformatician with a passion for machine learning and data analysis, please read on!</p><p></p><p>Weare looking for a skilledmachine learning engineerto jointhe datascienceteam. The successful applicant willimplement state of the artgraph neural networkmethodsfor drug target identificationwiththeEuretosKnowledge Graph.</p><p></p><p><strong>Euretos</strong></p><p></p><p>Euretos (www.euretos.com) provides AI driven research support as well as direct access to the Euretos AI Platform to enable in-silico discovery &amp; validation of targets, biomarkers and indications. By integrating over 250 different public databases, the Euretos platform provides the largest single environment in which the latest multi-omics data is interlinked to literature, experimental and clinical evidence.</p><p></p><p>We enable (pre)clinical researchers to take a systems biology approach connecting molecular multi-omics interactions, through cellular involvement, to the level of functional and phenotypic characterisation that are relevant for a disease or pathology. As part of this effort, Euretosusesstatistical modeling and machine learningtocreate computational disease models.</p><p></p><p>You will be working at our offices at the Utrecht Science Park, Yalelaan 1, Utrecht.</p><p></p><p><strong>Your Responsibilities</strong></p><p></p><ul><li>Implement state of the artmachine learning methods to expand the analytics capabilities of the Euretos AI platform, with a focus on applying deep learning and graph neural network approaches to knowledge graphs</li><li>Perform extensive characterisation and validation of the computational models developed by the data science team</li><li>Interact with bioinformaticiansand translational scientists to understand their needsandassisttheminobtainingbiological insights fromthecomputationalmodels</li></ul><p></p><p><strong>Your background</strong></p><p></p><ul><li>University degree, preferably a PhD, inmachine learning, computer science,statisticsor arelatedcomputational field</li><li>Expert programmer skills in Python andpreferablyR</li><li>Demonstrable experience in developing and implementing statistical models and machine learning methods for analysis of large-scale data sets</li><li>Hands-on experience with deep learning, specifically graph neural networks / graph convolutional networks</li><li>Experience working with large-scale biological datasets(-omics)is an advantage</li><li>Motivated toacquiredetailedknowledgeof relevantconcepts in biology and drug development</li><li>Strong interpersonal skills and ability to manage projects and work with cross-functional teams</li><li>Strong English writing and communication skills</li></ul><p><br></p><p><strong>Who you are</strong></p><p></p><ul><li>Self propelled – take initiative to bring things forward</li><li>Organised doer with hands-on mentality</li><li>Affinitywith biology and data analysis</li><li>Attention to detail</li><li>Systematic worker with a strong ability to meet deadlines</li></ul><p></p><p><strong>Apply Now!</strong></p><p></p><p>Do you think you are the right person for the job? Then apply now and:</p><p></p><ul><li>Send an email tojobs@euretos.comor </li><li>Contact Kees Albers onLinkedIn:https://nl.linkedin.com/in/kees-albers-721088151 </li></ul><p></p>",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-15T19:14:49.000Z"
  },
  "company": {
    "name": "Euretos",
    "link": "https://nl.linkedin.com/company/euretos"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "",
    "seniority_level": ""
  },
  "salary": {
    "currency": "",
    "min_value": "",
    "max_value": "",
    "unit": ""
  },
  "location": {
    "country": "NL",
    "locality": "Utrecht",
    "region": null,
    "postal_code": "3732",
    "street_address": null,
    "latitude": 52.08423,
    "longitude": 5.16388
  }
}