{
  "job": {
    "title": "Software Engineer (Entry level)",
    "industry": "Information Technology and Services",
    "description": "<p>Client is a team of software architecture specialists, bilingual in business and technology, who set the standard for architecture excellence in the insurance and healthcare industries. Careers with the client offer rapid growth, constant learning, and the immediate chance to make an impact. From day one here, you'll be working side-by-side with our senior architects, contributing to high-impact projects and meeting with our clients face- to-face. It’s a true meritocracy – fueled by a diversity of backgrounds, cultures, and experiences.</p><p></p><p>·Get involved in all phases of a project from discovery and planning through implementation  and delivery</p><p>·Participate in architecture definition, product selection, and application design</p><p>·Design and develop core business applications for insurance, healthcare and other industries</p><p>·Wear many hats and gain experience with tools, technologies and platforms across many technology stacks</p><p>·Work closely with Senior Developers and Architects</p><p>·Learn new things, and grow rapidly from constant exposure to innovative ideas, concepts, and patterns</p><p></p><p><strong>QUALIFICATIONS</strong></p><p><strong></strong></p><p>·Design, and develop business applications and integration solutions using Java/J2EE, .NET, and Javascript</p><p>·Degree in Computer Science (or equivalent) is preferred</p><p>·Knowledge of design patterns and the ability to apply them</p><p>·Strong problem solving skills</p><p>·Ability to conceptualize and articulate ideas clearly and concisely</p><p>·Excellent communication and interpersonal skills</p><p>·Willingness to travel on an occasional basis, as local and possibly out-of-state travel is required</p><p></p><p><strong>OUR PHILOSOPHIES</strong></p><p><strong></strong></p><p>·Agile approach – emphasis on good people, continuous delivery of value, close collaboration with clients</p><p>·Learning and reuse by leveraging patterns and frameworks</p><p>·Small teams focused on full life-cycle from discovery and planning through implementation and launch</p><p>·No technology bias and no affiliations with vendors – we use the technologies and approaches that make sense for our clients</p><p>·Constant learning – adding modern technologies, frameworks, tools and products to our tool belt</p><p><br></p><p><strong> WORK ENVIRONMENT AND CULTURE</strong></p><p><strong></strong></p><p>·Be surrounded by smart talented people with shared values of continually challenging, investing in, and stretching themselves to new levels</p><p>·Collaborate with seasoned architects to solve problems and to challenge assumptions</p><p>·Work in small teams with opportunities for rapid growth and accelerated responsibilities driven purely by individual performance</p><p>·Small company - open environment, flat organization, casual attire, flexibility, and no hierarchical structures.</p><p>·Everyone has a voice and is always encouraged to engage in shaping the company by sharing their interests, ideas, and feedback</p><p></p><p><strong>BENEFITS AND PERKS</strong></p><p><strong></strong></p><p>When it comes to our benefits and perks, we have everything you’d expect from health insurance, retirement</p><p>benefits and so on. But like our name, even our benefits exceed expectations.</p><p><br></p><p>·Health, Vision, Dental, Life, Disability</p><p>·401(k) with employer match</p><p>·Annual raises and promotions based on individual performance</p><p>·Programs: Professional Development, Wellness, Professional Dress allowance</p><p>·Discretionary Points and Travel Points redeemable for cash or additional time off</p><p>·Company sponsored social events for employees and families</p><p>·Work-Life Balance: flexible hours, vacation days, unlimited sick days, personal days, holidays</p>",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T18:09:51.000Z"
  },
  "company": {
    "name": "Collabera Inc.",
    "link": "https://www.linkedin.com/company/collabera"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "",
    "seniority_level": ""
  },
  "salary": {
    "currency": "",
    "min_value": "",
    "max_value": "",
    "unit": ""
  },
  "location": {
    "country": "US",
    "locality": "Detroit Metropolitan Area",
    "region": null,
    "postal_code": "48215",
    "street_address": null,
    "latitude": 42.339054,
    "longitude": -83.04875
  }
}