{
  "job": {
    "title": "ServiceNow Developer/Architect",
    "industry": "Information Services,Information Technology and Services,Financial Services",
    "description": "<p>Net2Source Inc. is an award-winning total workforce solutions company recognized by Staffing Industry Analysts for our accelerated growth of 300% in the last 3 years with over 5500+ employees globally, with over 30+ locations in the US and global operations in 32 countries. We believe in providing staffing solutions to address the current talent gap – Right Talent – Right Time – Right Place – Right Price and acting as a Career Coach to our consultants.</p><p></p><p><strong>Job Title: ServiceNow Developer/Architect</strong></p><p><strong>100% Remote</strong></p><p><strong>Full Time Hire / Permanent</strong></p><p><strong></strong></p><p><strong>Job Description:</strong></p><p>·Service now Implementation Specialist &amp; Admin</p><p>·Core module (Normal Incident, MIM, Problem, Knowledge, Change, ESS, CMS (optional))</p><p>·Good Communication and presentation skills, Client handling.</p><p>·Java Scripting knowledge and hands on experience on it.</p><p>·Hands-on with ITIL Process implementation.</p><p>·Service-now for custom Application Design &amp; Development.</p><p>·Hands-on technical delivery including required documentation of cost-effective Service-now solutions, Ability to create and Modify Workflows.</p><p>·Hands-on design, development and deployment experience with the Service-now platform.</p><p>·Hands-on migrating data from different tools into ServiceNow.</p><p>·Provide technical direction for the development, design, and systems integration for client engagement from definition phase through implementation.</p><p>·Review work of development team.</p><p>·Create and execute development plans as appropriate to meet changing needs and requirements.</p><p>·Communicate and enforce coding standards</p><p>·Good at creating required information for Reporting and Dashboards</p><p>·Knowledge of ITIL methodologies and processes.<strong> </strong></p><p><strong>Technical Expertise:</strong></p><p>·Creation of script-based Assignment and Approval rule.</p><p>·Creation of custom related list.</p><p>·Creation of Access Control List with the help of Scripting.</p><p>·Creation of Script based UI Policy and Client Script.</p><p>·Debugging script</p><p>·User Administration</p><p>·Web Service Integration</p><p>·User Interface Level Integration</p><p>·MID Server Integration</p><p>·Use of Import Sets for data loading from external file or database to the service-now.com</p><p>·Knowledge of ITIL V3 processes</p><p></p><p><strong>Why work with us -</strong> At Net2Source, we believe everyone has an opportunity to lead. We see the importance of your perspective and your ability to create value. We want you to fit in—with an inclusive culture, focus on work-life fit and well-being, and a supportive, connected environment; but we also want you to stand out—with opportunities to have a strategic impact, innovate, and take necessary steps to make your mark. We help clients with new skilling, talent strategy, leadership development, employee experience, transformational change management and beyond.</p><p></p><p><strong>Equal Employment Opportunity Statement:</strong></p><p>Net2Source is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. Our rich diversity makes us more innovative, more competitive, and more creative, which helps us better serve our clients and our communities. All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.</p><p></p><p><strong>Awards and Accolades:</strong></p><ul><li>America's Most Honored Businesses (Top 10%)</li><li>Awarded by USPAAC for Fastest Growing Business in the US</li><li>12th Fastest Growing Staffing Company in USA by Staffing industry Analysts in the US (2020, 2019, 2020)</li><li>Fastest 50 by NJ Biz (2020, 2019, 2020)</li><li>INC 5000 Fastest growing for 8 consecutive years in a row (only 1.26% companies make it to this list)</li><li>Top 100 by Dallas Business Journal (2020 and 2019)</li><li>Proven Supplier of the Year by Workforce Logiq (2020 and 2019)</li><li>2019 Spirit of Alliance Award by Agile1</li><li>2018 Best of the Best Platinum Award by Agile1</li><li>2018 TechServe Alliance Excellence Awards Winner</li><li>2017 Best of the Best Gold Award by Agile1(Act1 Group)</li></ul><p></p><p>Thanks &amp; Regards</p><p>Abhishek Kumar</p><p>Sr. Technical Recruiter</p><p>201-365-4885</p><p>abhishek@net2source.com</p>",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:16:56.000Z"
  },
  "company": {
    "name": "Net2Source Inc.",
    "link": "https://www.linkedin.com/company/net2sourceinc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "",
    "seniority_level": ""
  },
  "salary": {
    "currency": "",
    "min_value": "",
    "max_value": "",
    "unit": ""
  },
  "location": {
    "country": "US",
    "locality": "Bridgewater",
    "region": "NJ",
    "postal_code": "08807",
    "street_address": null,
    "latitude": 40.593002,
    "longitude": -74.626434
  }
}