{
  "job": {
    "title": "Principal Site Reliability Engineer ",
    "industry": "Information Technology and Services",
    "description": "<p>The Oracle Health Sciences Global Business Unit is looking for key software engineers who will play a critical role as part ofa site reliability engineering team supporting cloud offerings enabling pharmaceutical companies around the world.</p><p><br></p><p>As a site reliability engineer you will work with product development teams, Oracle cloud providers, support and other functional groups to ensure our cloud offerings continue to be resilient and meet our customer expectations around SLAs.This key role will include leveraging skills around production issue analysis and triage, scripting for the purpose ofautomation, monitoring and log analysis, root cause analysis for production issues, and cloud architecture design.</p><p><br></p><ul><li>Ability to script in python is key skillset</li><li>Familiar with cloud production architectures and solutions</li><li>Leverage scripting/programming to solve problems, automate tasks, etc</li><li>Creates and contribute to complex knowledge management articles and looks up existing knowledge management articles when needed.</li><li>Applies and maintains quality standards for custom written automation scripts and tools.</li><li>Participates inevaluationof tools and review of new processes around service levelimplement,monitoring,measurement</li><li>Design scalable, robust, secure systems using Oracle cloud architecture</li><li>Systems monitoring and logging experience with tools such as ELK, Thousand Eyes, Grafana</li><li>Build automation using industry tools (like Jenkins, Chef, Ansible, Hudson, etc.)</li><li>Ensure a high degree of availability across all of Oracle HSGBU service offerings.</li><li>Identify bottlenecks and problems throughout the infrastructure that are impacting HSGBU service offerings.</li><li>See projects/technical initiatives and architectural/technical service improvements through to completion collaborating across various functional teams.</li><li>Build automation reduce repetitive mundane tasks via scripting/programming associated with production service deployments</li><li>Develop custom tools as necessary to support HSGBU service offerings</li><li>Document system design, procedures, and work arounds as needed</li><li>Help maintain applications and services once they are live by measuring and monitoring availability, latency and overall system health based on service level objectives and service level indicators .</li><li>Participate in support driven incident response and postmortems, learning from outages and identifying fixes to outages small or large.</li><li>Partner and lead internal product teams in solving complex business needs associated with cloud offerings</li><li>Ensure offering SLA obligations are met, monitored, and measured updating and modifying monitoring andmeasurement approach when needed.</li><li>Involved in resolution of customer opened ticketsincludingdiagnosis and recommended short term and long term solutions.</li><li>Applies and maintains quality standards for custom written automation scripts and tools.</li><li>Works effectively in a mixed environment and uses best practices and knowledge of internal or external business issues to improve products or services.</li><li>Basic understanding of java is desirable </li><li>Need at minimum 4 years dev ops experience with a major cloud provider (AWS, Azure, Google Cloud, etc)</li><li>Basic understanding of operating system administration (Unix/windows)</li></ul><p><br></p><p><br></p><p>Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications. </p><p><br></p><p>As a member of the software engineering division, you will analyze and integrate external customer specifications. Specify, design and implement modest changes to existing software architecture. Build new products and development tools. Build and execute unit tests and unit test plans. Review integration and regression test plans created by QA. Communicate with QA and porting engineering to discuss major changes to functionality. </p><p><br></p><p>Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience. </p><p><br></p><p>If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 117076 in the subject line of the email.</p><p><br></p><p></p>",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T16:12:59.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": ""
  },
  "salary": {
    "currency": "",
    "min_value": "",
    "max_value": "",
    "unit": ""
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}