{
  "job": {
    "title": "Software Engineer",
    "industry": "Financial Services",
    "description": "<p><strong>Finland Fast Track Program</strong></p><p><br></p><p>This role is under the Finland Fast Track Program, an initiative of the Finland government to encourage exceptional international talent, specifically from the USA, to find fulfilling roles in the budding gaming and ICT industry in Finland.</p><p><br></p><p><strong><em>This role is based in Finland. Applicants are encouraged to and offered fast-track support to relocate there for this role, and the city you’ll move to will welcome you and your family with several relocation services.</em></strong></p><p><br></p><p><strong>Job Description</strong></p><p><br></p><p><strong>ABOUT ENFUCE</strong></p><p>The thing with us is that we certainly are not an uptight corporation but a highly eager group ofpeople who are admittedly very skilled with tech and we know the ins and outs of the PaymentIndustry. We are Finland’s biggest fintech startup and an award-winning innovative serviceprovider operating from the cloud. We are at the forefront in the Payment Industry and enableplayers in the Payment Industry to partner up fast and reliably. Our company consists ofIndustry experts with vast knowledge and experience within payments and tech and togetherwe enable the ecosystem around payments to evolve and grow. Innovative technology is thecore of our services.</p><p><br></p><p>We provide a wide range of Payment, Open Banking, and Sustainability services run in thecloud. All of our services are designed for security, compliance, and scalability. As of thismoment, we have over 10 million end-users, are operating globally, and constantly innovatingnew services to better serve our customers.</p><p><br></p><p><strong>What is the role all about?</strong></p><p>At Enfuce, the Software Engineer is part of the team that develops and maintains our softwareas well as our infrastructure. We do not mind exploring new technologies as we want to findthe best solution to fulfil the need. Which means that you can be working on everything fromLinux and Windows, Oracle databases, Java code to python scripts. What you will be working ondepends on your skills and your will to learn new and the latest things.</p><p><br></p><p><strong>Keys to success in this role</strong></p><p>You'll definitely succeed in this role by being curious, persistent and logical – a true techie whoenjoys living by the code of your craft by developing elegant solutions for complex problems. Ifthis sounds like you, then this is the perfect opportunity to join us!</p><p><br></p><p>If you have one or several of these attributes, we are definitely interested:</p><ul><li>AWS experience</li><li>Experience from DevOps tools</li><li>Java skills</li><li>Natural curiosity for thinking in systems and logical problem solving</li><li>Agile mindset (understanding and interest towards agile principles)</li><li>Willingness to take responsibility and ownership of your work</li><li>A team player with good communication skills</li></ul><p><br></p><p><strong>What we can offer you</strong></p><p>At Enfuce, one of our key characteristics is constant knowledge sharing and willingness to helpeach other. In fact we have people who are highly experienced in the field and are experts intech.</p><p><br></p><p>This is a permanent position and you would be working mostly from our Espoo or MariehamnOffice but we are a modern workplace where remote working is also possible. Along with salaryand other perks &amp; benefits, we offer a stock option program. A background check foremployment is conducted for this role.</p>",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-14T14:42:56.000Z"
  },
  "company": {
    "name": "Enfuce",
    "link": "https://fi.linkedin.com/company/enfuce"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": "",
    "seniority_level": ""
  },
  "salary": {
    "currency": "",
    "min_value": "",
    "max_value": "",
    "unit": ""
  },
  "location": {
    "country": "US",
    "locality": "Colorado",
    "region": "United States",
    "postal_code": "80425",
    "street_address": null,
    "latitude": 38.99855,
    "longitude": -105.54783
  }
}